artillery_config.yml
config:
  target: 'https://rockethacks-beta.vercel.app'
  phases:
    # Warm up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    
    # Ramp up phase
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up to moderate load"
    
    # Sustained load
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    
    # Spike test
    - duration: 60
      arrivalRate: 100
      name: "Spike test"
    
    # Recovery
    - duration: 120
      arrivalRate: 20
      name: "Recovery"
  
  # Performance thresholds
  ensure:
    maxErrorRate: 5
    p95: 500
    p99: 1000

scenarios:
  # Scenario 1: Homepage browsing
  - name: "Homepage Load"
    weight: 30
    flow:
      - get:
          url: "/"
          capture:
            - json: "$"
              as: "homepage"
          expect:
            - statusCode: 200
            - contentType: html
      
      - think: 2

  # Scenario 2: User journey - Browse to Apply
  - name: "User Journey"
    weight: 25
    flow:
      # Visit homepage
      - get:
          url: "/"
      
      - think: 3
      
      # View team page
      - get:
          url: "/team"
          expect:
            - statusCode: 200
      
      - think: 2
      
      # View FAQ
      - get:
          url: "/#faq"
      
      - think: 4
      
      # Try to access application (should redirect to login)
      - get:
          url: "/apply"
          followRedirect: false
          expect:
            - statusCode: [200, 302, 401]
      
      - think: 2

  # Scenario 3: Login attempts
  - name: "Login Page"
    weight: 20
    flow:
      - get:
          url: "/login"
          expect:
            - statusCode: 200
      
      - think: 5
      
      # Try to initiate OAuth (should redirect)
      - get:
          url: "/api/auth/login?provider=google"
          followRedirect: false
          expect:
            - statusCode: [302, 307]
      
      - think: 1

  # Scenario 4: Protected route access (security test)
  - name: "Security Test - Protected Routes"
    weight: 15
    flow:
      # Try to access admin without auth
      - get:
          url: "/admin"
          followRedirect: false
          expect:
            - statusCode: [302, 401, 403]
      
      - think: 1
      
      # Try to access admin API without auth
      - get:
          url: "/api/admin/applications"
          followRedirect: false
          expect:
            - statusCode: [401, 403]
      
      - think: 1
      
      # Try to access dashboard without auth
      - get:
          url: "/dashboard"
          followRedirect: false
          expect:
            - statusCode: [302, 401]
      
      - think: 1

  # Scenario 5: Static asset loading
  - name: "Static Assets"
    weight: 10
    flow:
      - get:
          url: "/assets/rh_26/rh_26_folder/rh_26_bundle_png/banner.png"
          expect:
            - statusCode: [200, 304, 404]
            - header: 
                name: "cache-control"
                exists: true
      
      - think: 0.5
      
      - get:
          url: "/_next/static/css/app/layout.css"
          expect:
            - statusCode: [200, 304, 404]
      
      - think: 0.5

# Reporting configuration
output:
  - type: "json"
    path: "artillery_report.json"
  
  - type: "html"
    path: "artillery_report.html"

# Enable plugins
plugins:
  expect: {}
  metrics-by-endpoint: {}

# Custom metrics
metrics:
  - name: "response_time_homepage"
    aggregation: "p95"
  - name: "response_time_api"
    aggregation: "p99"